Frank-Bemelman/HaniMandl-for-ESP32DEV/src/menu.cpp
#include <Arduino.h>

#include <ESP32Servo.h>             
#include <Arduino_GFX_Library.h>    
#include <TFT_eSPI.h>               // more versatile display library
#include <Preferences.h>            // eeprom acces library
#include <nvs_flash.h>              /* aus dem BSP von expressif, wird verfügbar wenn das richtige Board ausgewählt ist */

#include "hani.h"
#include <HX711_ADC.h>

extern void setPreferences(void);
extern int GetCurrent(int count);
extern void buzzer(int type);
extern void initRotaries( int rotary_mode, int rotary_value, int rotary_min, int rotary_max, int rotary_step );
extern int getRotariesValue( int rotary_mode );
extern void setRotariesValue( int rotary_mode, int rotary_value );

extern int alarm_overcurrent;          // Alarmflag wen der Servo zuwiel Strom zieht
extern int current_mA;                     // Strom welcher der Servo zieht
extern int offset_winkel;              // Offset in Grad vom Schlieswinkel wen der Servo Überstrom hatte (max +3Grad vom eingestelten Winkel min)
extern Servo servo;
extern int inawatchdog;                // 0 = aus, 1 = ein / wird benötigt um INA messung auszusetzen
extern Arduino_GFX *gfx;
//Color Scheme für den TFT Display
extern unsigned long  COLOR_BACKGROUND;
extern unsigned long  COLOR_TEXT;
extern unsigned long  COLOR_MENU_POS1;
extern unsigned long  COLOR_MENU_POS2;
extern unsigned long  COLOR_MENU_POS3;
extern unsigned long  COLOR_MENU_POS4;
extern unsigned long  COLOR_MARKER;
//Variablen für TFT update
extern bool no_ina;
extern int gewicht_alt;
extern int winkel_min_alt;
extern int pos_alt;
extern int winkel_ist_alt;
extern int tara_alt;
extern int current_mA_alt;
extern int servo_aktiv_alt;
extern int auto_aktiv_alt;
extern int glas_alt;
extern int korr_alt;
extern int rotary_select_alt;
extern int autokorr_gr_alt;
// Allgemeine Variablen
extern int i;                              // allgemeine Zählvariable
extern int pos;                            // aktuelle Position des Poti bzw. Rotary 
extern int gewicht;                        // aktuelles Gewicht
extern int tara;                           // Tara für das ausgewählte Glas, für Automatikmodus
extern int tara_glas;                      // Tara für das aktuelle Glas, falls Glasgewicht abweicht
extern long rawtareoffset;                  // Gewicht der leeren Waage
extern float CalibrationFactor;            // Skalierungsfaktor für Werte der Waage
extern int fmenge;                         // ausgewählte Füllmenge
extern int korrektur;                      // Korrekturwert für Abfüllmenge

extern int progressbar;                // Variable für den Progressbar
extern char ausgabe[];                   // Fontsize 12 = 13 Zeichen maximal in einer Zeile
extern int modus;                     // Bei Modus-Wechsel den Servo auf Minimum fahren
extern int auto_aktiv;                 // Für Automatikmodus - System ein/aus?
extern int winkel;                         // aktueller Servo-Winkel
extern float fein_dosier_gewicht;     // float wegen Berechnung des Schliesswinkels
extern int servo_aktiv;                // Servo aktivieren ja/nein
extern int StringLenght(String a);
extern int rotary_select;
extern int show_current;               // 0 = aus, 1 = ein / Zeige den Strom an auch wenn der INA ignoriert wird
extern bool bINA219_installed;   
extern bool gezaehlt;               // Kud Zähl-Flag
extern HX711_ADC LoadCell;
extern int kali_gewicht; 

extern Preferences preferences;

extern JarType JarTypes[];
extern ProductParameter Products[];

extern int SysParams[];
extern int GramsOnScale;
extern int ScaleStable;



extern void SetupMyDisplay(void);
extern void TFT_line_print(int line, const char *content, bool blink = false);
extern void TFT_line_color(int line, int textcolor, int backgroundcolor);
extern void TFT_line_blink(int line, bool blink); 
extern TFTline MyDisplay[];
extern void SelectMenu(int menu); 
extern bool IsPulsed(bool *button);

extern volatile bool deb_start_button;
extern volatile bool deb_stop_button;
extern volatile bool deb_encoder_button;
extern volatile bool deb_setup_switch;
extern volatile bool deb_auto_switch;
extern volatile bool deb_manual_switch;

extern bool bStartButtonPulsed;
extern bool bStopButtonPulsed;
extern bool bEncoderButtonPulsed;
extern bool bSetupSwitchPulsed;
extern bool bAutoSwitchPulsed;
extern bool bManualSwitchPulsed;


extern int start_button_f;
extern int stop_button_f;
extern int encoder_button_f;
extern int setup_switch_f;
extern int auto_switch_f;
extern int manual_switch_f;

extern TFT_eSPI tft;

extern int LastMenu;
extern int CurrentMenu;
extern int EditMenu;

extern Menu BigMenu[];
extern int ActLcdMode;
extern int NewWeight;
extern int OldWeight;


#define Y_SERVODATA 34

// local functions
void CalibrateScale(void);
void ParameterMenu(int menu);
void GetTextForMenuLine(char* text, int menu, int line); // build a single line with text and parameters 
void SetDefaultParameters(void);
void SaveParameters(void);
void LoadParameters(void);


 
void MenuHandler(void)
{ static int state = 0;
  static int newmenu;
  static int editmode = 0;
  char text[64];

  if(modus != MODE_SETUPMENU)state = 0; // new arrival

  switch(state)
  { case 0:
      // Select the right menu background stuff
      SelectMenu(HANI_MENU);
      modus = MODE_SETUPMENU;
      CurrentMenu = LastMenu;
      TFT_line_print(0, BigMenu[CurrentMenu].menuname);
      TFT_line_print(1, BigMenu[CurrentMenu].menuheader);
      sprintf(text, "%02d*%02d", LastMenu, SETUP_ENDOFMENU); 
      TFT_line_print(5, text);
      TFT_line_color(5, TFT_WHITE, TFT_BLACK);
      initRotaries(SW_MENU, LastMenu, SETUP_STARTOFMENU, SETUP_ENDOFMENU, 1);
      state++;
      return;
    case 1: // wandering in top menu selection
      rotary_select = SW_MENU;
      CurrentMenu = getRotariesValue(SW_MENU);
      if(CurrentMenu!=LastMenu)
      { LastMenu = CurrentMenu;
        TFT_line_print(0, BigMenu[CurrentMenu].menuname);
        TFT_line_print(1, BigMenu[CurrentMenu].menuheader);
        sprintf(text, "%02d*%02d", LastMenu, SETUP_ENDOFMENU);
        TFT_line_print(5, text);
      }

      break;
    default:
      break;
  }  

  if(encoder_button_f == deb_encoder_button) // state change 
  { encoder_button_f = 1234;  
    if(deb_encoder_button)  // pressed?)
    { editmode = true;
      TFT_line_print(1, "");
      TFT_line_print(5, "");
      delay(100); // give some time to background task for display update

