Frank-Bemelman/HaniMandl-for-ESP32DEV/src/menu.cpp
      // use the old menus
      switch(LastMenu)
      { case 0:   
          ParameterMenu(0);
          break;
        case 1:   
          CalibrateScale();         // new menu
          break;
        case 2:   
          ParameterMenu(2);
          break;  
        case 3:   
          ParameterMenu(3);
          break;  
        case 4:   
          ParameterMenu(4);
          break;  
        case 5:   
          ParameterMenu(5);
          break;  
        case 6:   
          ParameterMenu(6);
          break;  
        case 7:   
          ParameterMenu(7);
          break;  
        case 8:   
          ParameterMenu(9);
          break;  
        case 9:   
          ParameterMenu(10);  // languages
          break;  
        default:   
           break;  
       }
       editmode = false;
       ActLcdMode = 999; // force new display build
       CurrentMenu = 999; 
       modus = -1;
    } 
  }     
}


void CalibrateScale(void)
 { float gewicht_raw;
   int state = 0;
   int gewicht_alt = -9999;
   int kali_gewicht_old = -9999;
   unsigned long now;
   char text[64];

   IsPulsed(&bStartButtonPulsed); // reset the button flag
   IsPulsed(&bStopButtonPulsed); // reset the button flag
   IsPulsed(&bEncoderButtonPulsed); // reset the button flag
   IsPulsed(&bSetupSwitchPulsed); // reset the button flag
   IsPulsed(&bAutoSwitchPulsed); // reset the button flag
   IsPulsed(&bManualSwitchPulsed); // reset the button flag


   OldWeight = 0;
   while(true)
   { if(state==7) // waiting loop, nice to display weight after calibration
     { NewWeight = GramsOnScale;
     }

    
     if(IsPulsed(&bStopButtonPulsed) || !deb_setup_switch)
     { if(state<5)
       { LoadCell.setCalFactor(CalibrationFactor); 
       }
       state = 8; // Quick exit
     }
     switch(state)
     { case 0:
         TFT_line_color(4, TFT_BLACK, TFT_RED);
         TFT_line_print(4, "Empty Scale Please!", true);
         TFT_line_print(5, "Continue When Done");
         state++; 
         break;
       case 1: // wait for button
         if(IsPulsed(&bEncoderButtonPulsed))  // encoder pressed?)
         { LoadCell.setCalFactor(1);
           LoadCell.tare(); // returns after actual tarring
           state++;
         }
         break;
       case 2: 
         state++;
         break;  
       case 3: 
         TFT_line_color(3, TFT_BLACK, TFT_RED);
         TFT_line_print(3, "Place A Known Weight", true);
         TFT_line_print(5, "Continue When Done");
         initRotaries(SW_MENU, kali_gewicht, 100, 9999, 1); 
         state++;
       case 4: // let user adjust the known weight
         kali_gewicht = getRotariesValue(SW_MENU);
         if (kali_gewicht != kali_gewicht_old)
         {  sprintf(ausgabe, "Calibrate As %d gram", kali_gewicht);
            TFT_line_print(4, ausgabe);
         }
         if(IsPulsed(&bEncoderButtonPulsed))
         { state++; 
         }
         break;  
       case 5:
         gewicht_raw = GramsOnScale;
         CalibrationFactor = gewicht_raw / kali_gewicht;
         LoadCell.setCalFactor(CalibrationFactor); 
         rawtareoffset = LoadCell.getTareOffset(); // should be zero after fresh calibration
         //sprintf(text,"Empty Raw Weight = %d", rawtareoffset);
         //TFT_line_print(3, text);
         //sprintf(text,"Calibration Factor = %f", CalibrationFactor);
         //TFT_line_print(4, text);
         TFT_line_print(5, "Thank You!", true);
         setPreferences();
         SaveParameters();
         delay(1000);
         EditMenu = CurrentMenu;  // bepaalt of gewicht geprint wordt
         state++;
         break;

       case 6:
         state++;
         now = millis(); 
         break;  
       
       case 7:
         if((millis()-now)>2500)state++;
         break;  
       case 8:
         EditMenu = 0;
         return;
         break;  
     }
     delay(10); 
   
   } 

}



void ParameterMenu(int menu)
 { int state = 0;
   unsigned long now;
   int scrollpos = 0; // defines offset
   int editline = 0; // line to be changed
   int editline_old;
   int n;
   int menuitems;
   char text[128];
   int restorevalue;
   int restorevalue2;
   state = 0;
   int newvalue;
   int column; 

   IsPulsed(&bStartButtonPulsed); // reset the button flag
   IsPulsed(&bStopButtonPulsed); // reset the button flag
   IsPulsed(&bEncoderButtonPulsed); // reset the button flag
   IsPulsed(&bSetupSwitchPulsed); // reset the button flag
   IsPulsed(&bAutoSwitchPulsed); // reset the button flag
   IsPulsed(&bManualSwitchPulsed); // reset the button flag

   // first count menuitems
   menuitems=0;
   for(n=0;n<6;n++) // max 6 lines in menu
   { if(BigMenu[menu].line[n].targetidx != NOT_USED)menuitems++;
   }
   column = 1; // work on the first column

   while(true)
   { if(IsPulsed(&bStopButtonPulsed) || !deb_setup_switch)
     { if(state==4) // stop button and setup switch works as cancel while fiddling with the value
       { TFT_line_blink(editline-scrollpos+1,false); // unblink
         if(BigMenu[menu].line[editline].parmtype == SET_TARRA)TFT_line_color(editline-scrollpos+1, TFT_WHITE, TFT_BLACK); // back to normal
         if(BigMenu[menu].line[editline].parmtype == SET_JAR_PRESET)
         { Products[editline].Gewicht = restorevalue;
           Products[editline].GlasTyp = restorevalue2;
         }
         else if(BigMenu[menu].line[editline].parmtype == SET_TO_ZERO)
         { Products[editline].Count = restorevalue;
         }
         else
         { SysParams[BigMenu[menu].line[editline].targetidx] = restorevalue;
         }
         SysParams[BigMenu[menu].line[editline].selected] = false;
         GetTextForMenuLine(text, menu, editline);
         TFT_line_print(editline-scrollpos+1, text);
         initRotaries(SW_MENU, editline, 0, menuitems, 1);
         state = 1;  
       }
       else return;  
     }
    
