Frank-Bemelman/HaniMandl-for-ESP32DEV/src/menu.cpp
     switch(state)
     { case 0: // (re)print content
         for(n=0;n<4;n++) // max 4 lines to print
         { if(BigMenu[menu].line[n+scrollpos].targetidx != NOT_USED)
           { GetTextForMenuLine(text, menu, n+scrollpos);
             TFT_line_print(n+1, text);
             if(editline != (n+scrollpos))
             { TFT_line_color(n+1, TFT_WHITE, TFT_DARKGREY);
             }
             else
             { TFT_line_color(n+1, TFT_WHITE, TFT_BLACK); // display as chosen
             }
           }  
         }
         TFT_line_print(5, BigMenu[menu].bottomline, editline==menuitems);
         if(editline==menuitems)
         { TFT_line_color(5, TFT_WHITE, TFT_BLACK);
         }
         else
         { TFT_line_color(5, TFT_WHITE, TFT_DARKGREY); 
         }
         initRotaries(SW_MENU, editline, 0, menuitems, 1);
         editline_old = editline; 
         state++; 
         break;

       case 1: 
         state++;
         break;         

       case 2: // wander through the available menu items
         editline = getRotariesValue(SW_MENU);
         if(editline!=editline_old)
         { if(editline+scrollpos>3) // menuitems = 6, editline = 0-6 (7 values)
           { if(editline<menuitems) // not on the exit line
             { scrollpos = editline-3;
             }
           }
           else
           { if(editline<scrollpos)
             { scrollpos = editline;
             } 
           }
           state = 0;
         }
         else
         { if(IsPulsed(&bEncoderButtonPulsed))  // choice is made
           { if(editline==menuitems) // on the exit line
             { state = 5; 
             }
             else
             { BigMenu[menu].line[editline_old].selected = false;
               BigMenu[menu].line[editline].selected = true;
           
               TFT_line_blink(editline-scrollpos+1, true);
               if(MyDisplay[editline-scrollpos+1].scroll)  // is a a scrolling menuline, maybe a shortened text for this?
               { GetTextForMenuLine(text, menu, editline);
                 TFT_line_print(editline-scrollpos+1, text, true);
               }

               // setup encoder for this edit range
               if(BigMenu[menu].line[editline].parmtype==SET_JAR_PRESET)
               { restorevalue=Products[editline].Gewicht;
                 restorevalue2=Products[editline].GlasTyp;
                 TFT_line_print(5, "Please Set Net Weight");
                 initRotaries(SW_MENU, Products[editline].Gewicht, BigMenu[menu].line[editline].min, BigMenu[menu].line[editline].max, 1);
               }
               else if(BigMenu[menu].line[editline].parmtype==SET_TO_ZERO)
               {  restorevalue = Products[editline].Count;
                  initRotaries(SW_MENU, 0, BigMenu[menu].line[editline].min, BigMenu[menu].line[editline].max, 1);
               }
               else if(BigMenu[menu].line[editline].parmtype==SET_TRIPCOUNT)
               {  restorevalue = Products[editline].TripCount;
                  initRotaries(SW_MENU, Products[editline].TripCount, BigMenu[menu].line[editline].min, BigMenu[menu].line[editline].max, 1);
               }
               else
               { restorevalue = SysParams[BigMenu[menu].line[editline].targetidx];
                 initRotaries(SW_MENU, SysParams[BigMenu[menu].line[editline].targetidx], BigMenu[menu].line[editline].min, BigMenu[menu].line[editline].max, 1);
               }  
               state++;
             }  
           }
         }   
         break;

       case 3: // wait for button released
         state++;
         break;  
       case 4: // change the value with the rotary
         newvalue = getRotariesValue(SW_MENU);

         if(BigMenu[menu].line[editline].parmtype == SET_TARRA)
         { newvalue = GramsOnScale;
           if (newvalue<10)TFT_line_color(editline-scrollpos+1, TFT_RED, TFT_BLACK);
           else TFT_line_color(editline-scrollpos+1, TFT_GREEN, TFT_BLACK);
         }
         else if(BigMenu[menu].line[editline].parmtype == SET_DEGREES)
         { if(SysParams[LIVESETUP])SERVO_WRITE(newvalue);
         }
         


         if(editline<menuitems) // we have a target
         { if(BigMenu[menu].line[editline].parmtype==SET_JAR_PRESET) // different treatment of jar presets
           { if(column==1)
             { if(newvalue!=Products[editline].Gewicht)
               { Products[editline].Gewicht = newvalue;
                 GetTextForMenuLine(text, menu, editline);
                 TFT_line_print(editline-scrollpos+1, text, true);
               }
             }
             else // 2nd column
             { if(newvalue!=Products[editline].GlasTyp)
               { Products[editline].GlasTyp = newvalue;
                 GetTextForMenuLine(text, menu, editline);
                 TFT_line_print(editline-scrollpos+1, text, true);
               }
             }
           }
           else if (BigMenu[menu].line[editline].parmtype==SET_TO_ZERO)
           { if(newvalue!=Products[editline].Count)
              {Products[editline].Count = newvalue;
               GetTextForMenuLine(text, menu, editline);
               TFT_line_print(editline-scrollpos+1, text,true);
             }
           }
           else if (BigMenu[menu].line[editline].parmtype==SET_TARRA)
           { if(newvalue!=JarTypes[editline].tarra)
              {JarTypes[editline].tarra = newvalue;
               GetTextForMenuLine(text, menu, editline);
               TFT_line_print(editline-scrollpos+1, text, true);
             }
           }
           else if (BigMenu[menu].line[editline].parmtype==SET_TRIPCOUNT)
           { if(newvalue!=Products[editline].TripCount)
              {Products[editline].TripCount = newvalue;
               GetTextForMenuLine(text, menu, editline);
               TFT_line_print(editline-scrollpos+1, text, true);
             }
           }
           
           else if(newvalue!=SysParams[BigMenu[menu].line[editline].targetidx])
           { SysParams[BigMenu[menu].line[editline].targetidx] = newvalue;
             GetTextForMenuLine(text, menu, editline);
             TFT_line_print(editline-scrollpos+1, text, true);
           }

           if(IsPulsed(&bEncoderButtonPulsed))  // pressed?
           { if(column==BigMenu[menu].columns) // time to leave
             { TFT_line_blink(editline-scrollpos+1, false);
               if(BigMenu[menu].line[editline].parmtype == RESETPREFS)
               { preferences.begin("EEPROM", false);
                 preferences.clear();
                 preferences.end();
                 TFT_line_print(5, "Will Reboot Now!", true);
                 delay(2000);
                 ESP.restart();
               }
               if(BigMenu[menu].line[editline].parmtype == RESETEEPROM)
               { nvs_flash_erase();    // erase the NVS partition and...
                 nvs_flash_init();     // initialize the NVS partition.
                 //Da machen wir gerade einen restart
                 TFT_line_print(5, "Will Reboot Now!", true);
                 delay(2000);
                 ESP.restart();
               }
               if(BigMenu[menu].line[editline].parmtype == SET_TARRA)TFT_line_color(editline-scrollpos+1, TFT_WHITE, TFT_BLACK); // back to normal
               initRotaries(SW_MENU, editline, 0, menuitems, 1);
               column=1;  
               state=1; 
               BigMenu[menu].line[editline].selected = false; // not selected as target under edit anymore
               TFT_line_print(5, "Saved!", true);
               SaveParameters();
               delay(1000);
               TFT_line_print(5, BigMenu[menu].bottomline);
             }
             else
             { column++; 
               initRotaries(SW_MENU, Products[editline].GlasTyp, 0, 5, 1); // 5 different jar styles
               TFT_line_print(5, "Please Select Jar Type");

